# vim:foldmethod=marker
# General ------------------------------------------------------------------{{{

# Git
brew 'git'
brew 'tig'
brew 'scmpuff'

# Github CLI
brew 'hub'

# Bunch of cool git extras
brew 'git-extras'

# Zsh
brew 'zsh'
brew 'zsh-completions'

# Defaults
brew 'python3'
brew 'nvm'
brew 'wget'
brew 'ffmpeg'

# Better unix tools
brew 'coreutils'

# Better rename using
# Example: Rename extension
# $ rename 's/(.*)/new-ext/' *.old-ext
brew 'rename'

# Move to trash cli
brew 'trash'

# NeoVim
tap 'neovim/neovim'

# To support colorprofile conversion install imagemagick with little-cms
brew 'imagemagick', args: ['with-little-cms', 'with-little-cms2']

# Tool to manage the osx dock
brew "dockutil"

# Mac appstore command line tool
brew "mas"

# Neovim
brew "neovim/neovim/neovim", args: ["HEAD"]

brew 'reattach-to-user-namespace'

#}}}
# Applications -------------------------------------------------------------{{{

cask "1password"
cask "alfred"
cask "appcleaner"
cask "arduino"
cask "bartender"
cask "bettertouchtool"
cask "boom"
cask "default-folder-x"
cask "dropbox"
cask "fantastical"
cask "google-chrome"
cask "hammerspoon"
cask "hazel"
cask "iterm2-beta"
cask "iterm2-nightly"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "mailmate"
cask "marked"
cask "mplayerx"
cask "nvalt"
cask "sequel-pro"
cask "spotify"
cask "steam"
cask "trickster"
cask "virtualbox"
cask "visual-studio-code"
cask "xtrafinder"

#}}}
# Tools --------------------------------------------------------------------{{{

# ls Alternative
brew 'exa'
# Z Alternative
brew 'fasd'
# Quickly copy ssh keys
brew 'ssh-copy-id'
# Git deployment to servers without git
brew 'git-ftp'
# Donwload youtube videos
brew 'youtube-dl'
# CLI Fuzzy Finder
brew 'fzf'
# Tree folder architecture
brew 'tree'
# Better ack
brew 'the_silver_searcher'
# Faster newer version of 'Ag'
brew 'ripgrep'
# Pipe to vim
# echo 'text' | vipe
brew 'moreutils'
# Notifications
brew 'terminal-notifier'
# File manager
brew 'ranger'
# Spreadsheet Editor
brew tap nickolasburr/pfa
brew install sc-im

#}}}
# Coding -------------------------------------------------------------------{{{

# Golang
brew 'go', args: ["cross-compile-common"]

brew 'ctags'
brew 'editorconfig'
brew 'cheat'

# JSON Parser
brew 'jq'

# Syntax highlighting for ranger
brew 'highlight'

# Linters
brew 'CMake'
brew 'shellcheck'
brew 'phplint'

#}}}
# AppStore -----------------------------------------------------------------{{{

mas "Moom", id: 419330170
mas "Xcode", id: 497799835

#}}}
