# vim:foldmethod=marker
# General ------------------------------------------------------------------{{{

# Git
brew 'git'
brew 'tig'
brew 'scmpuff'

# Github CLI
brew 'hub'

# Bunch of cool git extras
brew 'git-extras'

# Zsh
brew 'zsh'
brew 'zsh-completions'

# python3
brew 'python3'

if [[ $INSTALL_NVM ]]; then
  brew 'nvm'
fi

# Defaults
brew 'wget'
brew 'ffmpeg'

# Better unix tools
brew 'coreutils'

# Better rename using
# Example: Rename extension
# $ rename 's/(.*)/new-ext/' *.old-ext
brew 'rename'

# Move to trash cli
brew 'trash'

# To support colorprofile conversion install imagemagick with little-cms
brew 'imagemagick', args: ['with-little-cms', 'with-little-cms2']

# Tool to manage the osx dock
brew "dockutil"

# Mac appstore command line tool
brew "mas"

# Neovim
tap 'neovim/neovim'
brew "neovim/neovim/neovim", args: ["HEAD"]

# tmux
brew 'reattach-to-user-namespace'

brew 'ispell', args: ['with-lang-en']

# ncurses disk analyzer
brew 'ncdu'

#}}}
# Applications -------------------------------------------------------------{{{

# All Macs
cask "1password"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "default-folder-x"
cask "dropbox"
cask "google-chrome"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "marked"
cask "selfcontrol"
cask "trickster"

if [[ $INSTALL_DEV_PACKAGES ]]; then
  cask "sequel-pro"
  cask "virtualbox"
  cask "visual-studio-code"
fi

if [[ $INSTALL_LATEX ]]; then
  cask "mactex"
fi


#}}}
# Tools --------------------------------------------------------------------{{{

# ls Alternative
brew 'exa'
# Z Alternative
brew 'fasd'
# Quickly copy ssh keys
brew 'ssh-copy-id'
# Donwload youtube videos
brew 'youtube-dl'
# CLI Fuzzy Finder
brew 'fzf'
# Tree folder architecture
brew 'tree'
# Better ack
brew 'the_silver_searcher'
# Faster newer version of 'Ag'
brew 'ripgrep'
# Notifications
brew 'terminal-notifier'
# File manager
brew 'ranger'
# Spreadsheet Editor
# brew tap 'nickolasburr/pfa'
# brew install sc-im
# Encryption
brew 'gnupg'

# Switch audio source in osx
# For alfred:
brew 'switchaudio-osx'

#}}}
# Coding -------------------------------------------------------------------{{{

if [[ $INSTAL_GO ]]; then
  # Golang
  brew 'go', args: ["cross-compile-common"]
fi

brew 'ctags'
brew 'editorconfig'

# JSON Parser
brew 'jq'

# Syntax highlighting for ranger
brew 'highlight'

# Linters
brew 'CMake'
brew 'shellcheck'
brew 'phplint'

#}}}
# AppStore -----------------------------------------------------------------{{{

if [[ $INSTALL_XCODE ]]; then
  mas "Xcode", id: 497799835
fi

mas "Moom", id: 419330170
mas "Chronoslider", id: 439549600

#}}}

# Fonts -------------------------------------------------------------------{{{

tap  "homebrew/cask-fonts"
cask "font-liberation-sans"

#}}}
